workspace/Enums/АукСтатусыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукСтатусыАукционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйЭтап</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Enums/АукВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПриемеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПриемеОтказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалить_УведомлениеОЗавершенииЭтапаАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПромежуточномПобедителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПобеде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОНачалеАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПроверкеНачалаАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПровереПереходаКПодведениюПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПереходеКПодведениюПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПроверкиПодведенияПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПровереПереходаКПодведениюИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПереходеКПодведениюИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПроверкеПодведенияИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбОтменеАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПереходеНаНовыйЭтапБезПодведенияПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОЗавершенииАукционаБезПодведенияИтогов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Enums/АукВидыРезультатовРасчетаИтогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукВидыРезультатовРасчетаИтогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минимальный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Максимальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/CommonModules/АукОбщийКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Преобразует полученные данные в строку формата JSON.
// Для значений с типом, не поддерживаемым при сериализации, будет вызвана функция преобразования ПривестиЗначениеПриЗаписиJSON.
// Перед обработкой значений новых типов следует модифицировать функцию преобразования.
//
// Параметры:
//  Данные - Произвольный - данные для сериализации.
//
// Возвращаемое значение:
//   Строка - сериализованные данные в формате JSON.
//
Функция СериализоватьВСтрокуJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализации);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция КлючиКоллекцииВМассив(пСоответствие) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого ЭлСоот Из пСоответствие Цикл
		масРезультат.Добавить(ЭлСоот.Ключ);	
	КонецЦикла;
	
	Возврат масРезультат;
КонецФункции

Функция JSONВЗначение(пДанные, пПрочитатьВСоответствие = Ложь, пИменаСвойствСоЗначениямиДата = Неопределено) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	
	Если ТипЗнч(пДанные) = Тип("Строка") Тогда
		ЧтениеJSON.УстановитьСтроку(пДанные);
		
	ИначеЕсли ТипЗнч(пДанные) = Тип("ДвоичныеДанные") Тогда 
		Поток = пДанные.ОткрытьПотокДляЧтения();
		ЧтениеJSON.ОткрытьПоток(Поток);
		
	ИначеЕсли ТипЗнч(пДанные) = Тип("Поток") 
		  Или ТипЗнч(пДанные) = Тип("ПотокВПамяти")
		  Или ТипЗнч(пДанные) = Тип("ФайловыйПоток") 
	Тогда 
		ЧтениеJSON.ОткрытьПоток(пДанные);
	КонецЕсли;
	
	Значение = ПрочитатьJSON(ЧтениеJSON, пПрочитатьВСоответствие, пИменаСвойствСоЗначениямиДата, ФорматДатыJSON.ISO);
	
	ЧтениеJSON.Закрыть();
	
	Если ТипЗнч(пДанные) = Тип("ДвоичныеДанные") Тогда
		Поток.Закрыть();
	КонецЕсли;
	
	Возврат Значение;
КонецФункции

Функция ДнейВГоду() Экспорт

	Возврат 365;
	
КонецФункции	

Функция ПостфиксПовторяющихсяИменРеквизитов() Экспорт

	Возврат "_";
	
КонецФункции	

Функция ВыгрузитьКолонкиВМассивСтруктур(пТаблица, пСтрКолонки) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из пТаблица Цикл
		сткДанныеСтроки = Новый Структура(пСтрКолонки);
		
		ЗаполнитьЗначенияСвойств(сткДанныеСтроки, СтрокаТаблицы); 
		
		масРезультат.Добавить(сткДанныеСтроки);		
	КонецЦикла;
	
	Возврат масРезультат		
КонецФункции

Функция МассивЗначенийВМассивСтруктур(пМассив, пКлючСтруктуры) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого ЭлементМассива Из пМассив Цикл	
		масРезультат.Добавить(Новый Структура(пКлючСтруктуры, ЭлементМассива));		
	КонецЦикла;
	
	Возврат масРезультат		
КонецФункции

Функция ТипЗначенияЭлементаПвхСоответствуетТипу(пТипЭлементаПвх, пТип) Экспорт

	Возврат пТипЭлементаПвх.Типы().Найти(пТип) <> Неопределено;
	
КонецФункции	

Функция РабочийДиапазон() Экспорт

	Возврат Новый Структура("НачалоДиапазона, ОкончаниеДиапазона", 8, 18);
	
КонецФункции

Функция МинимальнаяДлительностьЭтапа() Экспорт

	Возврат 20;
	
КонецФункции

Функция МинимальнаяДлительностьЭтапаАвтоматическийРежим() Экспорт

	Возврат 5;
	
КонецФункции

Функция СтруктураПоМассивуИмен(пМасИменаСвойств) Экспорт

	сткРезультат = Новый Структура;
	
	Для Каждого ЭлМас Из пМасИменаСвойств Цикл
		
		сткРезультат.Вставить(ЭлМас);
		
	КонецЦикла;
	
	Возврат сткРезультат
	
КонецФункции	

Функция ЭлементыСтавкиПоСтрокеТабличнойЧастиВМассив(пВидАукциона, пСтрокаТабличнойЧасти) Экспорт
	
	сооРезультат = Новый Соответствие;
	
	масСтруктураСтавки = АукОбщийВызовСервера.ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона);
	
	Для Каждого ЭлМас Из масСтруктураСтавки Цикл
		
		сооРезультат.Вставить(ЭлМас.ТехническоеНаименование, СериализаторXDTO.XMLСтрока(пСтрокаТабличнойЧасти[ЭлМас.ТехническоеНаименование]));
	
	КонецЦикла;	
	
	Возврат сооРезультат;
	
КонецФункции

Функция ПреобразоватьЧислоКСтрокеДляВычисления(пЧслИсходное) Экспорт

	Возврат ?(пЧслИсходное <> 0, Формат(пЧслИсходное, "ЧРД=.; ЧГ=0"), "0"); 
	
КонецФункции

Функция ЗаменитьРаспределяемуюСуммуВФормуле(пФормула, пЧслРаспределяемаяСумма) Экспорт

	Возврат СтрЗаменить(пФормула,
						"[Распределяемая сумма]",
						ПреобразоватьЧислоКСтрокеДляВычисления(пЧслРаспределяемаяСумма))
	
КонецФункции	

Функция ДанныеИтоговИзТаблицыИтогов(пТаблица) Экспорт

	масРез = Новый Массив;
	
	Для Каждого СтрокаТз Из пТаблица Цикл
		
		масРез.Добавить(ИтоговыеДанныеСтавокДанныеПоСтроке(СтрокаТз));
		
	КонецЦикла;
	
	Возврат масРез;
	
КонецФункции	

Функция ДанныеАукционаДляПроверки(пДанныеФормы) Экспорт
	сткДанныеАукциона = Новый Структура;
	
	сткДанныеАукциона.Вставить("ДатаНачала",	пДанныеФормы.ДатаНачала);
	сткДанныеАукциона.Вставить("ВидАукциона",	пДанныеФормы.ВидАукциона);
	
	Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		сткДанныеАукциона.Вставить("Сумма",			пДанныеФормы.Сумма);	
		сткДанныеАукциона.Вставить("Срок",			пДанныеФормы.Срок);
	Иначе
		сткДанныеАукциона.Вставить("Параметры",		ВыгрузитьКолонкиВМассивСтруктур(пДанныеФормы.Параметры, "Параметр, ЗначениеПараметра"));
	КонецЕсли;
		
	сткДанныеАукциона.Вставить("Участники",		ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(пДанныеФормы.Участники, "Участник", Истина));
	
	масЭтапы = Новый Массив;
	
	Для Каждого ЭлЭтап Из пДанныеФормы.Этапы Цикл
		сткЭтап = Новый Структура("НомерСтроки, Этап, ДлительностьДни, ДлительностьЧасы");
		
		ЗаполнитьЗначенияСвойств(сткЭтап, ЭлЭтап); 
		
		масЭтапы.Добавить(сткЭтап);	
	КонецЦикла;	
		
	сткДанныеАукциона.Вставить("Этапы",				масЭтапы);
	
	сооНачДанные = Новый Соответствие;
	Для Каждого ЭлУчастник Из сткДанныеАукциона.Участники Цикл
		масСтроки = пДанныеФормы.НачальныеДанные.НайтиСтроки(Новый Структура("Участник", ЭлУчастник));
		
		масНачДанные = Новый Массив;
		Для Каждого СтрокаТч Из масСтроки Цикл
			сткСтрокаТч = Новый Структура("СтрокаНачальныхДанных, ЭлементНачальныхДанных, ЗначениеНачальныхДанных");
		
			ЗаполнитьЗначенияСвойств(сткСтрокаТч, СтрокаТч); 
			
			масНачДанные.Добавить(сткСтрокаТч);		
		КонецЦикла;	
		
		Если масНачДанные.Количество() <> 0 Тогда
			сооНачДанные.Вставить(ЭлУчастник, масНачДанные);	
		КонецЕсли;	
	КонецЦикла;		
	
	сткДанныеАукциона.Вставить("НачальныеДанные",		сооНачДанные);
	
	сткНастройкиАвтоматики = Новый Структура("АвтоматическийСтарт,
											| АвтоматическийПереходКПодведениюПромежуточныхИтогов, АвтоматическоеПодведениеПромежуточныхИтогов,
											| АвтоматическийПереходКПодведениюОкончательныхИтогов, АвтоматическоеПодведениеОкончательныхИтогов");
	
	ЗаполнитьЗначенияСвойств(сткНастройкиАвтоматики, пДанныеФормы); 
	сткДанныеАукциона.Вставить("НастройкиАвтоматики",	сткНастройкиАвтоматики);
	
	Возврат сткДанныеАукциона;
КонецФункции

Функция СписокЭтаповПоУмолчанию() Экспорт

	масРезультат = Новый Массив;
	
	Для Сч = 1 По 5 Цикл
		
		масРезультат.Добавить(Новый Структура("Этап, ДлительностьДни, ДлительностьЧасы", Строка(Сч), 0, Дата('00010101010000')));
		
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции

Функция СписокПараметровПоУмолчанию() Экспорт
	масТехНаименования = Новый Массив;
	
	масТехНаименования.Добавить("Sum");
	масТехНаименования.Добавить("CountOfDays");
	
    сооРез = АукОбщийВызовСервера.ЭлементыДанныхАукционовПоТехническимНаименованиям(масТехНаименования);
	
	масРезультат = Новый Массив;
	Для Каждого ЭлСоо Из сооРез Цикл
		масРезультат.Добавить(ЭлСоо.Значение.ЭлементДанных);	
	КонецЦикла;	
	
	Возврат масРезультат;	
КонецФункции

Функция АвтоматическийРежим(пДанныеФормы) Экспорт
	Возврат пДанныеФормы.АвтоматическийСтарт
			Или пДанныеФормы.АвтоматическийПереходКПодведениюПромежуточныхИтогов
			Или пДанныеФормы.АвтоматическоеПодведениеПромежуточныхИтогов
			Или пДанныеФормы.АвтоматическийПереходКПодведениюОкончательныхИтогов
			Или пДанныеФормы.АвтоматическоеПодведениеОкончательныхИтогов;
КонецФункции

Функция СтатусРазрешаетИзменениеДанныхАукциона(пТекСтатус) Экспорт
    Возврат пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Новый")
			Или пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПустаяСсылка"); 
КонецФункции	

Функция СтатусРазрешаетЧастичноеИзменениеДанныхАукциона(пТекСтатус) Экспорт
    Возврат пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап")
			Или пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов"); 
КонецФункции

Функция СтатусЗапрещаетИзменениеДанныхАукциона(пТекСтатус) Экспорт
    Возврат пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеИтогов")
			Или пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Завершен")
			Или пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Архив")
			Или пТекСтатус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Отменен"); 
КонецФункции

Функция КаналВзаимодействия_ПочтовыйНеавтоматический() Экспорт
	Возврат XMLЗначение(Тип("СправочникСсылка.АукКаналыВзаимодействия"), "9fcce16a-8798-11f0-96d7-d85ed3194db9");	
КонецФункции

Функция ВидыСообщенийДляУведомленияУчастников() Экспорт
    масРезультат = Новый Массив;
	
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОНачалеАукциона"));
	
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПереходеКПодведениюПромежуточныхИтогов"));
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПромежуточномПобедителе"));
	
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПереходеКПодведениюИтогов"));
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПобеде"));
	
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПриемеСтавки"));
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПриемеОтказа"));	
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.ПростоеСообщение")); 
	
	масРезультат.Добавить(ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОбОтменеАукциона"));
	
	Возврат масРезультат;
КонецФункции	

Функция ВидРезультатРасчетаИтогаПоУмолчанию() Экспорт
	Возврат ПредопределенноеЗначение("Перечисление.АукВидыРезультатовРасчетаИтогов.Максимальный");	
КонецФункции	

Процедура УдалитьСтрокиТаблицыПоСтруктуреОтборов(пТаблица, пСткОтбор) Экспорт
	масСтрокиНаУдаление = пТаблица.НайтиСтроки(пСткОтбор);
	
	Для Каждого ЭлСтрока Из масСтрокиНаУдаление Цикл
		
		пТаблица.Удалить(ЭлСтрока);
		
	КонецЦикла;	
КонецПроцедуры	

Функция КолонкаТаблицыВМассивСОтборомПоТипу(КоллекцияСтрок, ИмяКолонки, ИмяКолонкиСТипом, ОтборТип) Экспорт
	МассивЗначений = Новый Массив;
	
	Для каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
		Если ТипЗначенияЭлементаПвхСоответствуетТипу(СтрокаКоллекции[ИмяКолонкиСТипом], ОтборТип) Тогда 
			Значение = СтрокаКоллекции[ИмяКолонки];

			МассивЗначений.Добавить(Значение);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат МассивЗначений;	
КонецФункции	

Функция ОтобратьЭлементыВМассивеСтруктур(пМассив, пСткОтбор) Экспорт
	НовыйМассив = Новый Массив;
	
	Для Каждого ЭлементМассива Из пМассив Цикл
		Если ЭлементКоллекцииПодходитПоОтбор(ЭлементМассива, пСткОтбор) Тогда
			НовыйМассив.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НовыйМассив;
КонецФункции	

Функция ДанныеПобедителяЭтапаИзТаблицыРезультатовЭтапа(пАукцион, пНомерЭтапа, пСтрокаТаблицы) Экспорт
	сткДанные = Новый Структура;
	
	сткДанные.Вставить("Аукцион",				пАукцион);
	сткДанные.Вставить("НомерЭтапа",			пНомерЭтапа);
	
	сткДанные.Вставить("ДатаСтавки",			пСтрокаТаблицы.ДатаСтавки);	
	сткДанные.Вставить("Участник",				пСтрокаТаблицы.Участник);
	сткДанные.Вставить("СтрокаДанных",			пСтрокаТаблицы.СтрокаДанных);	
	сткДанные.Вставить("РезультатРасчета",		пСтрокаТаблицы.РезультатРасчета);
	
	сткДанные.Вставить("ПредставлениеРезультатаРасчета",	пСтрокаТаблицы.ПредставлениеРезультатаРасчета);
	
	Возврат сткДанные;	
КонецФункции

Функция ДанныеПобедителейИзТаблицРезультатов(пДанные) Экспорт
	сткДанные = Новый Структура;
	сткДанные.Вставить("Аукцион",		пДанные.Аукцион);
	сткДанные.Вставить("НомерЭтапа",	пДанные.НомерЭтапа);
	
	сткДанные.Вставить("ПараметрыАукциона",	ПараметрыАукционаИзДанныхРасчетаИтогов(пДанные.тзПараметрыАукциона));
	сткДанные.Вставить("ПеременныеФормулы",	ПеременныеФормулыИзДанныхРасчетаИтогов(пДанные.тзИтогиАукциона, пДанные.Переменные));
	сткДанные.Вставить("РезультатыРасчета",	РезультатыРасчетаИзДанныхРасчетаИтогов(пДанные.тзИтогиАукциона));
	
	Возврат сткДанные;	
КонецФункции

Функция ОперандПредставленияПромежуточногоИтога() Экспорт
	Возврат "[Результат]";	
КонецФункции	

Функция НовыРасчетИтогаВключен() Экспорт
	Возврат Истина;	
КонецФункции

Процедура УдалитьСтрокиТабличнойЧастиПоОтбору(пТаблица, пСткОтбор) Экспорт
	масСтрокиТаблица = пТаблица.НайтиСтроки(пСткОтбор);
	
	Для Каждого СтрокаТаблицы Из масСтрокиТаблица Цикл
		пТаблица.Удалить(СтрокаТаблицы);	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПроверкиНастроекАукциона

Функция ВыполнитьКонтрольОбычныхНастроек(пСткДанныеАукциона) Экспорт
	масПредупреждения = Новый Массив;
	
    // 1. Дата начала в рабочее время (с 00:00 до 8:00)	
	Если Не ВремяНачалаПопадаетВРабочийДиапазон(пСткДанныеАукциона.ДатаНачала) Тогда	
		масПредупреждения.Добавить(НСтр("ru = 'Время начала не входит в рабочий диапазон'"));	
	КонецЕсли;	
	
	// 2. Длительность этапа не может быть менее 20 минут
	Если Не ПродолжительностьЭтаповНеСодержитОшибки(пСткДанныеАукциона.Этапы) Тогда	
		масПредупреждения.Добавить(СтрШаблон(НСтр("ru = 'Длительность одного из этапов меньше %1 минут'"), МинимальнаяДлительностьЭтапа()));	
	КонецЕсли;
	
	// 3. Заполненность начальных данных
	масУчастникиБезНачальныхДанных = Новый Массив;
	Для Каждого ЭлУчастник Из пСткДанныеАукциона.Участники Цикл
		Если пСткДанныеАукциона.НачальныеДанные.Получить(ЭлУчастник) = Неопределено Тогда	
			масУчастникиБезНачальныхДанных.Добавить(ЭлУчастник);		
		КонецЕсли;	
	КонецЦикла;
	
	Если масУчастникиБезНачальныхДанных.Количество() <> 0 Тогда	
		масПредупреждения.Добавить(СтрШаблон(НСтр("ru = 'Не введены начальные данные для %1 %2'"),
														?(масУчастникиБезНачальныхДанных.Количество() = 1, "участника -", "участников:"),
														СтрСоединить(масУчастникиБезНачальныхДанных, ", ")));	
	КонецЕсли;	
	
	Если масПредупреждения.Количество() <> 0 Тогда
		Возврат ЭдоОбщий._Ошибка(СтрСоединить(масПредупреждения, Символы.ПС));	
	Иначе	
		Возврат ЭдоОбщий._Успех();
	КонецЕсли;
КонецФункции	

// Предполагаем, что нерабочее время с 00:00 до 8:00
//
Функция ВремяНачалаПопадаетВРабочийДиапазон(пДатаВремя) Экспорт
	
	сткРабочийДиапазон = РабочийДиапазон();
	
	Возврат Час(пДатаВремя) >= сткРабочийДиапазон.НачалоДиапазона И Час(пДатаВремя) <= сткРабочийДиапазон.ОкончаниеДиапазона;
	
КонецФункции	

// Предполагаем, что длительность этапа не может быть менее 20 минут
//
Функция ПродолжительностьЭтаповНеСодержитОшибки(пТчЭтапы) Экспорт
	
	булРезультат = Истина;
	
	Для Каждого СтрокаТч Из пТчЭтапы Цикл
		 
		Если ДлительностьЭтапаПоСтрокеНеудовлетворительная(СтрокаТч, МинимальнаяДлительностьЭтапа()) Тогда	
			
			булРезультат = Ложь;
			
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат булРезультат;
	
КонецФункции	

#КонецОбласти

#Область ИтоговыеРасчеты

Функция ПредопределенныеОперандыДляРасчетаОкончательногоИтога() Экспорт
	
	масРезультат = Новый Массив;
		
	// "Предопределенные" операнды	
	масРезультат.Добавить("Дней в году");
	масРезультат.Добавить("Срок");
	масРезультат.Добавить("Распределяемая сумма");
	
	Возврат масРезультат;
	
КонецФункции

#КонецОбласти

#Область ВалидацияДанных

Функция EmailКорректный(пСтрEmail) Экспорт

	Возврат АукОбщийВызовСервера.СтрокаПодобнаРегулярномуВыражению(пСтрEmail, Шаблон_Email());
	
КонецФункции	

#КонецОбласти

#Область ВалидацияДанныхШаблоны

Функция Шаблон_Email() Экспорт

	Возврат "([a-zA-Z0-9._-]+@[a-zA-Z0-9._-]+\.[a-zA-Z0-9_-]+)";
	
КонецФункции

Функция Шаблон_ТехническоеНаименованиеЭлементовПВХ() Экспорт

	Возврат "^[A-Za-z][A-Za-z0-9]*$";
	
КонецФункции

Функция Шаблон_НаименованиеЭлементовПВХ() Экспорт

	Возврат "^[a-zA-Zа-яА-ЯёЁ0-9_\s\.\(\)]+$";
	
КонецФункции

Функция Шаблон_ОперандФормулаРасчетаИтогов() Экспорт

	Возврат "\[[a-zA-Zа-яА-яёЁ0-9\s\.\(\)_]+\]";
	
КонецФункции

Функция Шаблон_ОперандФормулыРасчетаИтоговБезСкобок() Экспорт

	Возврат "(?<=\[).*?(?=\])"; 
	//Возврат "(?<=\[)[a-zA-Zа-яА-яёЁ0-9_]+(?=\])";
	
КонецФункции

Функция Шаблон_КорректноеИмяОперанда() Экспорт

	Возврат "[a-zA-Zа-яА-яёЁ0-9_]*?";
	
КонецФункции

Функция Шаблон_ОперандыИАрифметическиеЗнакиВФормулеРасчетаИтогов() Экспорт

	Возврат "\[[a-zA-Zа-яА-яёЁ0-9\s\.\(\)_]+\]|\*|\/|[0-9%\.\(\)]+|-|\+";
	
КонецФункции

Функция Шаблон_ПараметрыШаблонаСообщения() Экспорт

	Возврат "(?<=\[)[А-Я0-9_]*(?=\])";
	
КонецФункции

Функция Шаблон_ВалидацияПараметовШаблонаСообщения() Экспорт

	Возврат "\[[^\[\]]+\]";
	
КонецФункции

Функция Шаблон_ГраницыИмениПеременнойФормулы() Экспорт

	Возврат "\[|\]";
	
КонецФункции

Функция Шаблон_ПредставлениеПромежуточногоИтогаБезКлючевогоСлова() Экспорт

	Возврат "^.*?(?=\[)|(?<=\]).*$";
	
КонецФункции

Функция Шаблон_ПредставлениеПромежуточногоИтогаCКлючевымСловом() Экспорт

	Возврат "^.*?(?=\[)|(?<=\]).*$|\[.+\]";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыАукционаИзДанныхРасчетаИтогов(пТзПараметрыАукциона)
    масДанные = Новый Массив;
	
	Для Каждого СтрокаТз Из пТзПараметрыАукциона Цикл
		масДанные.Добавить(Новый Структура("Параметр, Значение", СтрокаТз.Параметр, СтрокаТз.ТекущееЗначение));	
	КонецЦикла;	
	
	Возврат масДанные;
КонецФункции

Функция ПеременныеФормулыИзДанныхРасчетаИтогов(пТзИтогиАукциона, пМасПеременные)
    масДанные = Новый Массив;
	
	Для Каждого СтрокаТз Из пТзИтогиАукциона Цикл
		сткДанныеСтроки = Новый Структура;
		сткДанныеСтроки.Вставить("Участник",		СтрокаТз.Участник);
		сткДанныеСтроки.Вставить("СтрокаДанных",	СтрокаТз.СтрокаДанных);
		
		масПеременные = Новый Массив;
		Для Каждого сткЭлПеременная Из пМасПеременные Цикл
			сткДанныеПеременной = Новый Структура;
			сткДанныеПеременной.Вставить("Переменная",			сткЭлПеременная);
			сткДанныеПеременной.Вставить("ТипПеременной",		СтрокаТз[сткЭлПеременная + "_Тип"]);
			сткДанныеПеременной.Вставить("ЗначениеПеременной",	СтрокаТз[сткЭлПеременная]);
			
			масПеременные.Добавить(сткДанныеПеременной);
		КонецЦикла;
		
		сткДанныеСтроки.Вставить("Переменные",	масПеременные);
		
		масДанные.Добавить(сткДанныеСтроки);
	КонецЦикла;	
	
	Возврат масДанные;
КонецФункции

Функция РезультатыРасчетаИзДанныхРасчетаИтогов(пТзИтогиАукциона)
	масДанные = Новый Массив;
	
	Для Каждого СтрокаТз Из пТзИтогиАукциона Цикл
		сткДанныеСтроки = Новый Структура("Участник, СтрокаДанных, РезультатРасчета, УчастникВыбран, ЭтоПобедитель");
		
		ЗаполнитьЗначенияСвойств(сткДанныеСтроки, СтрокаТз);
		
		масДанные.Добавить(сткДанныеСтроки);
	КонецЦикла;	
	
	Возврат масДанные;
КонецФункции

Функция ЭлементКоллекцииПодходитПоОтбор(пЭлементКоллекции, пСткОтбор) Экспорт
	булРез = Истина;
	
	Для Каждого ЭлСткОтбор Из пСткОтбор Цикл
		Если пЭлементКоллекции[ЭлСткОтбор.Ключ] <> ЭлСткОтбор.Значение Тогда
			булРез = Ложь;
			
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат булРез;
КонецФункции	

Функция ИтоговыеДанныеСтавокДанныеПоСтроке(пСтрокаТз)
		
	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Участник",				пСтрокаТз.Участник);
	сткРезультат.Вставить("СтрокаДанных",			пСтрокаТз.СтрокаДанных);
	сткРезультат.Вставить("РаспределяемаяСумма",	пСтрокаТз.РаспределяемаяСумма);
	сткРезультат.Вставить("ЭтоПобедитель",			пСтрокаТз.ПобедительФактический);
	
	Возврат сткРезультат;
	
КонецФункции

Функция СрокИспользованияПредложения(пСтрокаТз, пСрокПоУмолчанию)
	
	Если пСтрокаТз.Свойство("CountOfDays") И ЗначениеЗаполнено(пСтрокаТз.CountOfDays) Тогда
		Возврат пСтрокаТз.CountOfDays;
	ИначеЕсли пСтрокаТз.Свойство("CountOfDays_") И ЗначениеЗаполнено(пСтрокаТз.CountOfDays_) Тогда
		Возврат пСтрокаТз.CountOfDays_;
	Иначе
		Возврат пСрокПоУмолчанию;	
	КонецЕсли;	
			
КонецФункции

Функция ДлительностьЭтапаПоСтрокеНеудовлетворительная(пСтрокаЭтап, пМинДлительность) Экспорт

	Возврат пСтрокаЭтап.ДлительностьДни = 0 И (пСтрокаЭтап.ДлительностьЧасы - Дата("00010101")) / 60 < пМинДлительность;
	
КонецФункции	

#КонецОбласти

#Область ДинамическийСписок

// Пользовательские настройки - это коллекция состоящая из следующих элементов:
//		- ОтборКомпоновкиДанных
//		- ПорядокКомпоновкиДанных
//		- УсловноеОформлениеКомпоновкиДанных
//		- СтруктураНастроекКомпоновкиДанных
// Чтобы не обращаться по индексу пройдемся циклом
// По-умолчанию пусть будет самый популярный
//
&НаКлиенте
Функция ЭлементПользовательскихНастроекКомпоновкиДанныхПоТипу(пСписок, пТипЭлемента) Экспорт
	ЭлементОтбора = Неопределено;
	
	Для Каждого ЭлементНастроек Из пСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если ТипЗнч(ЭлементНастроек) = пТипЭлемента Тогда	
			ЭлементОтбора = ЭлементНастроек;
			
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ЭлементОтбора;
КонецФункции

#КонецОбласти

#Область РаботаСФормой

Процедура ОбновитьОтборКонтактныхЛицДляВсехУчастников(пКоллекцияСтрокТч, пВидАукциона) Экспорт
	
	масУчастники = ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(пКоллекцияСтрокТч, "Участник", Истина);
	
	сооКонтактныеЛицаУчастника = АукОбщийВызовСервера.КонтактныеЛицаУчастникаПоВидуАукциона(масУчастники, пВидАукциона);
	
	Для Каждого СтрокаТч Из пКоллекцияСтрокТч Цикл
		
		ЗаполнитьКонтактныеЛицаОтборПоСтроке(СтрокаТч, сооКонтактныеЛицаУчастника);	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКонтактныеЛицаОтборПоСтроке(пСтрокаТч, пСооКонтактныеЛицаУчастника) Экспорт
	
	масКонтЛица = пСооКонтактныеЛицаУчастника.Получить(пСтрокаТч.Участник);
	
	Если масКонтЛица <> Неопределено Тогда
		
		пСтрокаТч.КонтактныеЛицаОтбор = Новый ФиксированныйМассив(масКонтЛица);
		
	Иначе
		
		пСтрокаТч.КонтактныеЛицаОтбор = Новый ФиксированныйМассив(Новый Массив);
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область Логирование

Процедура ОтправитьСообщениеВГрейлог(пСообщение, пСобытие, пСтадия = "") Экспорт

	сткНастройкиЛога = ЭдоОбщийЛогированиеКлиентСервер.Инициализация("Котировки");
	
	сткНастройкиВывода = ЭдоОбщийЛогированиеКлиентСервер.СтруктураНастроекВыводаВГрейЛог();
	
	сткНастройкиВывода.Процесс = "Котировки";
	
	сткНастройкиВывода.ДопДанные.Вставить("event", пСобытие);
	сткНастройкиВывода.ДопДанные.Вставить("stage", пСтадия);
	
	ЭдоОбщийЛогированиеКлиентСервер.ВключитьВыводВГрейЛог(сткНастройкиЛога, сткНастройкиВывода);
	
	ЭдоОбщийЛогированиеКлиентСервер.Лог(сткНастройкиЛога, пСообщение);
	
КонецПроцедуры	

#КонецОбласти
